In [663]:
import pandas as pd
import numpy as np
import re
from dateutil.parser import parse

## 1. How to create a series from a list, numpy array and dict?

Difficulty Level: L1

Create a pandas series from each of the items below: a list, numpy and a dictionary

In [4]:
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))

In [10]:
s1 = pd.Series(mylist)
s2 = pd.Series(myarr)
s3 = pd.Series(mydict)

## 2. How to convert the index of a series into a column of a dataframe?
Difficulty Level: L1

Convert the series ser into a dataframe with its index as another column on the dataframe.

In [9]:
s3.reset_index()

   index   0
0      a   0
1      b   1
2      c   2
3      e   3
4      d   4
5      f   5
6      g   6
7      h   7
8      i   8
9      j   9
10     k  10
11     l  11
12     m  12
13     n  13
14     o  14
15     p  15
16     q  16
17     r  17
18     s  18
19     t  19
20     u  20
21     v  21
22     w  22
23     x  23
24     y  24
25     z  25

## 3. How to combine many series to form a dataframe?
Difficulty Level: L1

Combine ser1 and ser2 to form a dataframe.

In [12]:
df_concat = pd.concat([s1,s2],axis=1)

## 4. How to assign name to the series’ index?
Difficulty Level: L1

Give a name to the series ser calling it ‘alphabets’.

In [14]:
df_concat.index.name = 'alpha'
df_concat

       0   1
alpha
0      a   0
1      b   1
2      c   2
3      e   3
4      d   4
5      f   5
6      g   6
7      h   7
8      i   8
9      j   9
10     k  10
11     l  11
12     m  12
13     n  13
14     o  14
15     p  15
16     q  16
17     r  17
18     s  18
19     t  19
20     u  20
21     v  21
22     w  22
23     x  23
24     y  24
25     z  25

## 5. How to get the items of series A not present in series B?
Difficulty Level: L2

From ser1 remove items present in ser2.

In [15]:
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])

In [17]:
ser1[ser1.isin(ser2)]

3    4
4    5
dtype: int64

## 6. How to get the minimum, 25th percentile, median, 75th, and max of a numeric series?
Difficuty Level: L2

Compute the minimum, 25th percentile, median, 75th, and maximum of ser.

In [19]:
ser1.describe()

count    5.000000
mean     3.000000
std      1.581139
min      1.000000
25%      2.000000
50%      3.000000
75%      4.000000
max      5.000000
dtype: float64

## 7. How to get frequency counts of unique items of a series?
Difficulty Level: L1

Calculte the frequency counts of each unique value ser.

In [20]:
ser = pd.Series(np.take(list('abcdefgh'), np.random.randint(8, size=30)))
ser

0     g
1     g
2     c
3     f
4     h
5     g
6     a
7     e
8     a
9     e
10    e
11    h
12    c
13    c
14    d
15    g
16    f
17    h
18    h
19    h
20    d
21    b
22    d
23    a
24    g
25    a
26    a
27    c
28    g
29    d
dtype: object

In [21]:
ser.value_counts()

g    6
h    5
a    5
c    4
d    4
e    3
f    2
b    1
dtype: int64

## 8. How to keep only top 2 most frequent values as it is and replace everything else as ‘Other’?
Difficulty Level: L2

From ser, keep the top 2 most frequent items as it is and replace everything else as ‘Other’.

In [28]:
ser[~ser.isin(ser.value_counts().head(2).index.values)] = 'other'

In [29]:
ser

0         g
1         g
2     other
3     other
4         h
5         g
6     other
7     other
8     other
9     other
10    other
11        h
12    other
13    other
14    other
15        g
16    other
17        h
18        h
19        h
20    other
21    other
22    other
23    other
24        g
25    other
26    other
27    other
28        g
29    other
dtype: object

## 9. How to convert a numpy array to a dataframe of given shape? (L1)
Difficulty Level: L1

Reshape the series ser into a dataframe with 7 rows and 5 columns

In [32]:
ser = pd.Series(np.random.randint(1, 10, 35))
ser

0     6
1     3
2     1
3     4
4     4
5     8
6     3
7     3
8     8
9     6
10    4
11    7
12    8
13    4
14    3
15    4
16    8
17    5
18    9
19    5
20    6
21    5
22    3
23    6
24    8
25    9
26    2
27    5
28    9
29    2
30    2
31    7
32    3
33    8
34    1
dtype: int64

In [34]:
pd.DataFrame(np.array(ser).reshape([7,5]))

   0  1  2  3  4
0  6  3  1  4  4
1  8  3  3  8  6
2  4  7  8  4  3
3  4  8  5  9  5
4  6  5  3  6  8
5  9  2  5  9  2
6  2  7  3  8  1

## 10. How to find the positions of numbers that are multiples of 3 from a series?
Difficulty Level: L2

Find the positions of numbers that are multiples of 3 from ser.

In [37]:
ser = pd.Series(np.random.randint(1, 10, 7))
ser

0    3
1    1
2    3
3    4
4    8
5    1
6    1
dtype: int64

In [39]:
ser[(ser%3)==0].index

Int64Index([0, 2], dtype='int64')

## 11. How to extract items at given positions from a series
Difficulty Level: L1

From ser, extract the items at positions in list pos.

In [40]:
ser = pd.Series(list('abcdefghijklmnopqrstuvwxyz'))
pos = [0, 4, 8, 14, 20]

In [41]:
ser.iloc[pos]

0     a
4     e
8     i
14    o
20    u
dtype: object

## 12. How to stack two series vertically and horizontally ?
Difficulty Level: L1

Stack ser1 and ser2 vertically and horizontally (to form a dataframe).

In [120]:
ser1 = pd.Series(range(5))
ser2 = pd.Series(list('abcde'))

In [42]:
pd.concat([ser1,ser2],axis=0) #adiciona linhas

0    1
1    2
2    3
3    4
4    5
0    4
1    5
2    6
3    7
4    8
dtype: int64

In [43]:
pd.concat([ser1,ser2],axis=1) #adiciona nova coluna

   0  1
0  1  4
1  2  5
2  3  6
3  4  7
4  5  8

## 13. How to get the positions of items of series A in another series B?
Difficulty Level: L2

Get the positions of items of ser2 in ser1 as a list.

In [47]:
ser1 = pd.Series([10, 9, 6, 5, 3, 1, 12, 8, 13])
ser2 = pd.Series([1, 3, 10, 13])

In [50]:
ser1[ser1.isin(ser2)].index

Int64Index([0, 4, 5, 8], dtype='int64')

## 14. How to convert the first character of each element in a series to uppercase?
Difficulty Level: L2

Change the first character of each word to upper case in each word of ser.

In [54]:
ser = pd.Series(['how', 'to', 'kick', 'ass?'])

In [55]:
ser.apply(str.capitalize)

0     How
1      To
2    Kick
3    Ass?
dtype: object

## 15. How to calculate the number of characters in each word in a series?
Difficulty Level: L2

In [65]:
ser.map(lambda x: len(x))

0    3
1    2
2    4
3    4
dtype: int64

## 16. How to compute difference of differences between consequtive numbers of a series?
Difficulty Level: L1

Difference of differences between the consequtive numbers of ser.

In [66]:
ser = pd.Series([1, 3, 6, 10, 15, 21, 27, 35])

In [68]:
ser.diff()

0    NaN
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
6    6.0
7    8.0
dtype: float64

## 17. How to convert a series of date-strings to a timeseries?
Difficiulty Level: L2

In [189]:
ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])

In [190]:
from dateutil.parser import parse
ser.index = ser.apply(parse)
ser

2010-01-01 00:00:00         01 Jan 2010
2011-02-02 00:00:00          02-02-2011
2012-03-03 00:00:00            20120303
2013-04-04 00:00:00          2013/04/04
2014-05-05 00:00:00          2014-05-05
2015-06-06 12:20:00    2015-06-06T12:20
dtype: object

## 18. How to get the day of month, week number, day of year and day of week from a series of date strings?
Difficiulty Level: L2

Get the day of month, week number, day of year and day of week from ser.

In [ ]:
ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])

In [ ]:
ser = ser.apply(parse)

In [76]:
ser.dt.day

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [78]:
ser.dt.isocalendar().week

0    53
1     5
2     9
3    14
4    19
5    23
Name: week, dtype: UInt32

In [79]:
ser.dt.day_of_year

0      1
1     33
2     63
3     94
4    125
5    157
dtype: int64

In [80]:
ser.dt.day_of_week

0    4
1    2
2    5
3    3
4    0
5    5
dtype: int64

## 19. How to convert year-month string to dates corresponding to the 4th day of the month?
Difficiulty Level: L2

Change ser to dates that start with 4th of the respective months.

In [108]:
ser = pd.Series(['Jan 2010', 'Feb 2011', 'Mar 2012'])

In [109]:
ser = ser.apply(parse)

In [126]:
ser.map(lambda x: x.replace(day=4))

0   2010-01-04
1   2011-02-04
2   2012-03-04
dtype: datetime64[ns]

## 20. How to filter words that contain at least 2 vowels from a series?
Difficiulty Level: L3

From ser, extract words that contain atleast 2 vowels.

In [132]:
ser = pd.Series(['Apple', 'Orange', 'Plan', 'Python', 'Money'])

In [148]:
ser[ser.apply(lambda x: True if len(re.findall('[AEIOUaeiou]',x))>=2 else False)]

0     Apple
1    Orange
4     Money
dtype: object

In [147]:
re.sub('teste (.*)','\g<1>','teste regex alan')

'regex alan'

## 21. How to filter valid emails from a series?
Difficiulty Level: L3

Extract the valid emails from the series emails. The regex pattern for valid emails is provided as reference.

In [152]:
emails = pd.Series(['buying books at amazom.com', 'rameses@egypt.com', 'matt@t.co', 'narendra@modi.com','rameses'])
pattern = '[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\.[A-Za-z]{2,4}'

In [155]:
emails[emails.apply(lambda x: True if len(re.findall(pattern, x))>0 else False)]

1    rameses@egypt.com
2            matt@t.co
3    narendra@modi.com
dtype: object

## 22. How to get the mean of a series grouped by another series?
Difficiulty Level: L2

Compute the mean of weights of each fruit.

In [160]:
fruit = pd.Series(np.random.choice(['apple', 'banana', 'carrot'], 10))
weights = pd.Series(np.linspace(1, 10, 10))

In [161]:
df = pd.concat([fruit,weights],axis=1)
df.columns= ['fruits','weights']
df.groupby(['fruits']).mean()

        weights
fruits
apple       4.0
banana      7.5
carrot      6.0

## 23. How to compute the euclidean distance between two series?
Difficiulty Level: L2

Compute the euclidean distance between series (points) p and q, without using a packaged formula.

In [163]:
p = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
q = pd.Series([10, 9, 8, 7, 6, 5, 4, 3, 2, 1])

In [174]:
np.sqrt(np.power(p,2)+np.power(q,2))

0    10.049876
1     9.219544
2     8.544004
3     8.062258
4     7.810250
5     7.810250
6     8.062258
7     8.544004
8     9.219544
9    10.049876
dtype: float64

## 24. How to replace missing spaces in a string with the least frequent character?
Replace the spaces in my_str with the least frequent character.

Difficiulty Level: L2

In [176]:
my_str = 'dbc deb abed gade'

In [177]:
ser = pd.Series(list(my_str))

In [187]:
re.sub(' ', ser.value_counts().keys()[-1],my_str)

'dbccdebcabedcgade'

## 25. How to create a TimeSeries starting ‘2000-01-01’ and 10 weekends (saturdays) after that having random numbers as values?
Difficiulty Level: L2

In [210]:
pd.Series(np.random.random(10),index=pd.date_range('2000-01-01',periods=10,freq='W-SAT'))

2000-01-01 00:00:00    0.697548
2000-01-01 01:00:00    0.289384
2000-01-01 02:00:00    0.964545
2000-01-01 03:00:00    0.731570
2000-01-01 04:00:00    0.704567
2000-01-01 05:00:00    0.070050
2000-01-01 06:00:00    0.550945
2000-01-01 07:00:00    0.959564
2000-01-01 08:00:00    0.858271
2000-01-01 09:00:00    0.525563
Freq: H, dtype: float64

## 26. How to fill an intermittent time series so all missing dates show up with values of previous non-missing date?
Difficiulty Level: L2

ser has missing dates and values. Make all missing dates appear and fill up with value from previous date.

In [200]:
ser = pd.Series([1,10,3,np.nan], index=pd.to_datetime(['2000-01-01', '2000-01-03', '2000-01-06', '2000-01-08']))
ser

2000-01-01     1.0
2000-01-03    10.0
2000-01-06     3.0
2000-01-08     NaN
dtype: float64

In [212]:
ser.resample('D').bfill()

2000-01-01     1.0
2000-01-02    10.0
2000-01-03    10.0
2000-01-04     3.0
2000-01-05     3.0
2000-01-06     3.0
2000-01-07     NaN
2000-01-08     NaN
Freq: D, dtype: float64

## 27. How to compute the autocorrelations of a numeric series?
Difficiulty Level: L3

Compute autocorrelations for the first 10 lags of ser. Find out which lag has the largest correlation.

In [215]:
ser = pd.Series(np.arange(20) + np.random.normal(1, 10, 20))
ser

0    -13.791475
1     -9.352414
2    -12.152264
3      8.186870
4     -1.516188
5     -0.051248
6    -14.181797
7     22.392316
8      6.752901
9      8.580975
10    19.870892
11     2.820053
12    31.223630
13    29.136504
14     2.523166
15    18.048804
16    38.508128
17    31.912144
18    19.101514
19    -5.653660
dtype: float64

In [216]:
ser.autocorr(10)

-0.06317462937355756

## 28. How to get the nrows, ncolumns, datatype, summary stats of each column of a dataframe? Also get the array and list equivalent.
Difficulty Level: L2

Get the number of rows, columns, datatype and summary statistics of each column of the Cars93 dataset. Also get the numpy array and list equivalent of the dataframe.

In [221]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

In [223]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 93 entries, 0 to 92
Data columns (total 27 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Manufacturer        89 non-null     object
 1   Model               92 non-null     object
 2   Type                90 non-null     object
 3   Min.Price           86 non-null     float64
 4   Price               91 non-null     float64
 5   Max.Price           88 non-null     float64
 6   MPG.city            84 non-null     float64
 7   MPG.highway         91 non-null     float64
 8   AirBags             87 non-null     object
 9   DriveTrain          86 non-null     object
 10  Cylinders           88 non-null     object
 11  EngineSize          91 non-null     float64
 12  Horsepower          86 non-null     float64
 13  RPM                 90 non-null     float64
 14  Rev.per.mile        87 non-null     float64
 15  Man.trans.avail     88 non-null     object
 16  Fuel.tank.capacity  85 non-null     float64
 17  Passengers          91 non-null     float64
 18  Length              89 non-null     float64
 19  Wheelbase           92 non-null     float64
 20  Width               87 non-null     float64
 21  Turn.circle         88 non-null     float64
 22  Rear.seat.room      89 non-null     float64
 23  Luggage.room        74 non-null     float64
 24  Weight              86 non-null     float64
 25  Origin              88 non-null     object
 26  Make                90 non-null     object
dtypes: float64(18), object(9)
memory usage: 19.7+ KB

## 29. How to extract the row and column number of a particular cell with given criterion?
Difficulty Level: L1

Input

df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')
Which manufacturer, model and type has the highest Price? What is the row and column number of the cell with the highest Price value?

In [224]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')
df.head(3)

,Manufacturer,Model,Type,Min.Price,Price,Max.Price,MPG.city,MPG.highway,AirBags,DriveTrain,...,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight,Origin,Make
0,Acura,Integra,Small,12.9,15.9,18.8,25.0,31.0,None,Front,...,5.0,177.0,102.0,68.0,37.0,26.5,NaN,2705.0,non-USA,Acura Integra
1,NaN,Legend,Midsize,29.2,33.9,38.7,18.0,25.0,Driver & Passenger,Front,...,5.0,195.0,115.0,71.0,38.0,30.0,15.0,3560.0,non-USA,Acura Legend
2,Audi,90,Compact,25.9,29.1,32.3,20.0,26.0,Driver only,Front,...,5.0,180.0,102.0,67.0,37.0,28.0,14.0,3375.0,non-USA,Audi 90

In [230]:
df.iloc[df['Price'].idxmax,[0,1,2,4]]

Manufacturer    Mercedes-Benz
Model                    300E
Type                  Midsize
Price                    61.9
Name: 58, dtype: object

## 30. How to rename a specific columns in a dataframe?
Difficulty Level: L2

Rename the column Type as CarType in df and replace the ‘.’ in column names with ‘_’.

In [231]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')
df.head(2)

,Manufacturer,Model,Type,Min.Price,Price,Max.Price,MPG.city,MPG.highway,AirBags,DriveTrain,...,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight,Origin,Make
0,Acura,Integra,Small,12.9,15.9,18.8,25.0,31.0,None,Front,...,5.0,177.0,102.0,68.0,37.0,26.5,NaN,2705.0,non-USA,Acura Integra
1,NaN,Legend,Midsize,29.2,33.9,38.7,18.0,25.0,Driver & Passenger,Front,...,5.0,195.0,115.0,71.0,38.0,30.0,15.0,3560.0,non-USA,Acura Legend

In [235]:
df.columns.values[2]='CarType'

In [236]:
df.head(2)

,Manufacturer,Model,CarType,Min.Price,Price,Max.Price,MPG.city,MPG.highway,AirBags,DriveTrain,...,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight,Origin,Make
0,Acura,Integra,Small,12.9,15.9,18.8,25.0,31.0,None,Front,...,5.0,177.0,102.0,68.0,37.0,26.5,NaN,2705.0,non-USA,Acura Integra
1,NaN,Legend,Midsize,29.2,33.9,38.7,18.0,25.0,Driver & Passenger,Front,...,5.0,195.0,115.0,71.0,38.0,30.0,15.0,3560.0,non-USA,Acura Legend

## 31. How to count the number of missing values in each column?
Difficulty Level: L2

Count the number of missing values in each column of df. Which column has the maximum number of missing values?

In [237]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')
df.head(2)

,Manufacturer,Model,Type,Min.Price,Price,Max.Price,MPG.city,MPG.highway,AirBags,DriveTrain,...,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight,Origin,Make
0,Acura,Integra,Small,12.9,15.9,18.8,25.0,31.0,None,Front,...,5.0,177.0,102.0,68.0,37.0,26.5,NaN,2705.0,non-USA,Acura Integra
1,NaN,Legend,Midsize,29.2,33.9,38.7,18.0,25.0,Driver & Passenger,Front,...,5.0,195.0,115.0,71.0,38.0,30.0,15.0,3560.0,non-USA,Acura Legend

In [251]:
df.isnull().sum()

Manufacturer           4
Model                  1
Type                   3
Min.Price              7
Price                  2
Max.Price              5
MPG.city               9
MPG.highway            2
AirBags                6
DriveTrain             7
Cylinders              5
EngineSize             2
Horsepower             7
RPM                    3
Rev.per.mile           6
Man.trans.avail        5
Fuel.tank.capacity     8
Passengers             2
Length                 4
Wheelbase              1
Width                  6
Turn.circle            5
Rear.seat.room         4
Luggage.room          19
Weight                 7
Origin                 5
Make                   3
dtype: int64

## 32. How to replace missing values of multiple numeric columns with the mean?
Difficulty Level: L2

Replace missing values in all numeric  columns with their respective mean.

In [336]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')
df.head(2)

,Manufacturer,Model,Type,Min.Price,Price,Max.Price,MPG.city,MPG.highway,AirBags,DriveTrain,...,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight,Origin,Make
0,Acura,Integra,Small,12.9,15.9,18.8,25.0,31.0,None,Front,...,5.0,177.0,102.0,68.0,37.0,26.5,NaN,2705.0,non-USA,Acura Integra
1,NaN,Legend,Midsize,29.2,33.9,38.7,18.0,25.0,Driver & Passenger,Front,...,5.0,195.0,115.0,71.0,38.0,30.0,15.0,3560.0,non-USA,Acura Legend

In [337]:
means = df[df.dtypes[df.dtypes=='float64'].keys()].mean()
means

Min.Price               17.118605
Price                   19.616484
Max.Price               21.459091
MPG.city                22.404762
MPG.highway             29.065934
EngineSize               2.658242
Horsepower             144.000000
RPM                   5276.666667
Rev.per.mile          2355.000000
Fuel.tank.capacity      16.683529
Passengers               5.076923
Length                 182.865169
Wheelbase              103.956522
Width                   69.448276
Turn.circle             38.954545
Rear.seat.room          27.853933
Luggage.room            13.986486
Weight                3104.593023
dtype: float64

In [338]:
df.fillna(means,inplace=True)

In [339]:
df.isnull().sum()

Manufacturer          4
Model                 1
Type                  3
Min.Price             0
Price                 0
Max.Price             0
MPG.city              0
MPG.highway           0
AirBags               6
DriveTrain            7
Cylinders             5
EngineSize            0
Horsepower            0
RPM                   0
Rev.per.mile          0
Man.trans.avail       5
Fuel.tank.capacity    0
Passengers            0
Length                0
Wheelbase             0
Width                 0
Turn.circle           0
Rear.seat.room        0
Luggage.room          0
Weight                0
Origin                5
Make                  3
dtype: int64

## 33. How to select a specific column from a dataframe as a dataframe instead of a series?
Difficulty Level: L2

Get the first column (a) in df as a dataframe (rather than as a Series).

In [675]:
df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))
df

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [676]:
pd.DataFrame(df['a'])

    a
0   0
1   5
2  10
3  15

## 34. How to change the order of columns of a dataframe?
Difficulty Level: L3

Actually 3 questions.

In df, interchange columns 'a' and 'c'.
Create a generic function to interchange two columns, without hardcoding column names.

Sort the columns in reverse alphabetical order, that is colume 'e' first through column 'a' last.

In [305]:
df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))
df

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [306]:
df.loc[:,['c','b','a','d','e']]

    c   b   a   d   e
0   2   1   0   3   4
1   7   6   5   8   9
2  12  11  10  13  14
3  17  16  15  18  19

In [307]:
df.loc[:,np.flip(np.sort(df.columns.values))]

    e   d   c   b   a
0   4   3   2   1   0
1   9   8   7   6   5
2  14  13  12  11  10
3  19  18  17  16  15

## 35. How to format all the values in a dataframe as percentages?
Difficulty Level: L2

Format the values in column 'random' of df as percentages.

In [328]:
df = pd.DataFrame(np.random.random(4), columns=['random'])
df

     random
0  0.981387
1  0.041433
2  0.312882
3  0.428902

In [335]:
out = df.style.format({'random': '{:.2%}'.format,}) # .3f
out

## 36. How to create a primary key index by combining relevant columns?
Difficulty Level: L2

In df, Replace NaNs with ‘missing’ in columns 'Manufacturer', 'Model' and 'Type' and create a index as a combination of these three columns and check if the index is a primary key.

In [341]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv', usecols=[0,1,2,3,5])

missing = {'Manufacturer': 'missing', 'Model': 'missing', 'Type': 'missing'}

In [342]:
df.fillna(missing,inplace=True)

In [343]:
df.index = df['Manufacturer'] + df['Model'] + df['Type']

In [345]:
df.head(5)

                     Manufacturer    Model     Type  Min.Price  Max.Price
AcuraIntegraSmall           Acura  Integra    Small       12.9       18.8
missingLegendMidsize      missing   Legend  Midsize       29.2       38.7
Audi90Compact                Audi       90  Compact       25.9       32.3
Audi100Midsize               Audi      100  Midsize        NaN       44.6
BMW535iMidsize                BMW     535i  Midsize        NaN        NaN

## 37. How to get the row number of the nth largest value in a column?
Difficulty Level: L2

Find the row position of the 5th largest value of column 'a' in df.

In [346]:
df = pd.DataFrame(np.random.randint(1, 30, 30).reshape(10,3), columns=list('abc'))
df.head(4)

    a   b   c
0  28   5  28
1   6  12   6
2   4  29  17
3  27   5  25

In [353]:
sort_df =df.sort_values(by=['a'])
sort_df

    a   b   c
6   1   7  12
2   4  29  17
1   6  12   6
7  10  21   7
5  16  12  13
8  22  16  27
9  26   9   7
3  27   5  25
0  28   5  28
4  28  14   5

In [354]:
sort_df.index.values[-1]

4

## 38. How to find the position of the nth largest value greater than a given value?
Difficulty Level: L2

In ser, find the position of the 2nd largest value greater than the mean.

In [374]:
ser = pd.Series([7, 77, 16, 86, 60, 38, 34, 36, 83, 27, 16, 52, 50, 52, 54] )
ser.head(3)

0     7
1    77
2    16
dtype: int64

In [360]:
sort_val = ser.sort_values()
sort_val

0      7
2     16
10    16
9     27
6     34
7     36
5     38
12    50
11    52
13    52
14    54
4     60
1     77
8     83
3     86
dtype: int64

In [378]:
a = sort_val[sort_val>sort_val.mean()]
a.index.values[1]

11

## 39. How to get the last n rows of a dataframe with row sum > 100?
Difficulty Level: L2

Get the last two rows of df whose row sum is greater than 100.

In [386]:
df = pd.DataFrame(np.random.randint(10, 40, 60).reshape(-1, 4))
df.sum()

     0   1   2   3
0   12  26  37  26
1   35  23  29  17
2   12  32  12  26
3   11  27  17  39
4   13  21  26  35
5   36  12  14  39
6   16  29  36  27
7   25  33  38  38
8   39  17  23  38
9   26  18  17  21
10  12  17  23  17
11  35  36  28  12
12  21  10  37  15
13  39  27  32  17
14  16  15  33  39

In [392]:
df[df.sum(axis=1)>100].tail(2)

     0   1   2   3
13  39  27  32  17
14  16  15  33  39

## 40. How to find and cap outliers from a series or dataframe column?
Difficulty Level: L2

Replace all values of ser in the lower 5%ile and greater than 95%ile with respective 5th and 95th %ile value.

In [393]:
ser = pd.Series(np.logspace(-2, 2, 30))

In [394]:
low, high =ser.quantile([.5,.95])
print('low: {}, high: {}'.format(low, high))

low: 1.0126350749753805, high: 63.876672220183934

In [395]:
ser[ser>high]=high
ser[ser<low]= low

In [396]:
ser

0      1.012635
1      1.012635
2      1.012635
3      1.012635
4      1.012635
5      1.012635
6      1.012635
7      1.012635
8      1.012635
9      1.012635
10     1.012635
11     1.012635
12     1.012635
13     1.012635
14     1.012635
15     1.172102
16     1.610262
17     2.212216
18     3.039195
19     4.175319
20     5.736153
21     7.880463
22    10.826367
23    14.873521
24    20.433597
25    28.072162
26    38.566204
27    52.983169
28    63.876672
29    63.876672
dtype: float64

## 41. How to reshape a dataframe to the largest possible square after removing the negative values?
Difficulty Level: L3

Reshape df to the largest possible square with negative values removed. Drop the smallest values if need be. The order of the positive numbers in the result should remain the same as the original.

In [397]:
df = pd.DataFrame(np.random.randint(-20, 50, 100).reshape(10,-1))
df

    0   1   2   3   4   5   6   7   8   9
0  -7 -20  20  -1 -10  -8  -9  43  21   1
1  15  44  12 -17 -14 -15 -20 -15 -14  34
2  -7  36  37  -3  39 -19  36   1  -2  -9
3  -9  10  25 -11 -17  42   8  29  44  34
4  34 -14 -13  27  24  17  42  36 -15  -5
5  12  16  46  31  14   8  41  -6  20  23
6  -3  33  -5  29  22  37  44  18  -4   0
7   6   4  -8 -14  12   7  -9  32 -19 -19
8  24  -6  10 -18   6  10 -10 -11   6  18
9  42  37  -7  46 -19  -2 -18  -1  32  27

In [405]:
res_df = np.array(df).reshape(1,-1).ravel()
res_df

array([ -7, -20,  20,  -1, -10,  -8,  -9,  43,  21,   1,  15,  44,  12,
       -17, -14, -15, -20, -15, -14,  34,  -7,  36,  37,  -3,  39, -19,
        36,   1,  -2,  -9,  -9,  10,  25, -11, -17,  42,   8,  29,  44,
        34,  34, -14, -13,  27,  24,  17,  42,  36, -15,  -5,  12,  16,
        46,  31,  14,   8,  41,  -6,  20,  23,  -3,  33,  -5,  29,  22,
        37,  44,  18,  -4,   0,   6,   4,  -8, -14,  12,   7,  -9,  32,
       -19, -19,  24,  -6,  10, -18,   6,  10, -10, -11,   6,  18,  42,
        37,  -7,  46, -19,  -2, -18,  -1,  32,  27])

In [411]:
without_neg = res_df[res_df>=0]
without_neg

array([20, 43, 21,  1, 15, 44, 12, 34, 36, 37, 39, 36,  1, 10, 25, 42,  8,
       29, 44, 34, 34, 27, 24, 17, 42, 36, 12, 16, 46, 31, 14,  8, 41, 20,
       23, 33, 29, 22, 37, 44, 18,  0,  6,  4, 12,  7, 32, 24, 10,  6, 10,
        6, 18, 42, 37, 46, 32, 27])

In [416]:
without_neg.argsort()

array([41,  3, 12, 43, 42, 51, 49, 45, 16, 31, 50, 48, 13,  6, 26, 44, 30,
        4, 27, 23, 52, 40, 33,  0,  2, 37, 34, 47, 22, 14, 57, 21, 17, 36,
       29, 56, 46, 35,  7, 19, 20, 25, 11,  8, 38, 54,  9, 10, 32, 53, 15,
       24,  1,  5, 39, 18, 55, 28])

In [418]:
without_neg_min = without_neg[without_neg.argsort()[9:]]
without_neg_min

array([ 8, 10, 10, 10, 12, 12, 12, 14, 15, 16, 17, 18, 18, 20, 20, 21, 22,
       23, 24, 24, 25, 27, 27, 29, 29, 31, 32, 32, 33, 34, 34, 34, 36, 36,
       36, 37, 37, 37, 39, 41, 42, 42, 42, 43, 44, 44, 44, 46, 46])

In [419]:
len(without_neg_min)

49

In [421]:
pd.DataFrame(without_neg_min.reshape(7,7))

    0   1   2   3   4   5   6
0   8  10  10  10  12  12  12
1  14  15  16  17  18  18  20
2  20  21  22  23  24  24  25
3  27  27  29  29  31  32  32
4  33  34  34  34  36  36  36
5  37  37  37  39  41  42  42
6  42  43  44  44  44  46  46

## 42. How to swap two rows of a dataframe?
Difficulty Level: L2

Swap rows 1 and 2 in df.

In [422]:
df = pd.DataFrame(np.arange(25).reshape(5, -1))
df

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24

In [423]:
df = df.iloc[[0,2,1,3,4],:]
df

    0   1   2   3   4
0   0   1   2   3   4
2  10  11  12  13  14
1   5   6   7   8   9
3  15  16  17  18  19
4  20  21  22  23  24

## 43. How to reverse the rows of a dataframe?
Difficulty Level: L2

Reverse all the rows of dataframe df.

In [424]:
df = pd.DataFrame(np.arange(25).reshape(5, -1))
df

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24

In [425]:
df = df.iloc[np.flip(df.index.values),:]
df

    0   1   2   3   4
4  20  21  22  23  24
3  15  16  17  18  19
2  10  11  12  13  14
1   5   6   7   8   9
0   0   1   2   3   4

## 44. Which column contains the highest number of row-wise maximum values?
Difficulty Level: L2

Obtain the column name with the highest number of row-wise maximum’s in df.

In [427]:
df = pd.DataFrame(np.random.randint(1,100, 40).reshape(10, -1))
df

    0   1   2   3
0  32  17  15  71
1  40  55  39   5
2  92  53  52  28
3  82  84  95  50
4   9  73  98  40
5  69  51  72  93
6  57  45  43   3
7  43  10  75  83
8  77  57  55  44
9  92  47   5  20

In [432]:
df.idxmax(axis=1).value_counts().idxmax()

0

## 45. How to create a new column that contains the row number of nearest column by euclidean distance?
Create a new column such that, each row contains the row number of nearest row-record by euclidean distance.

Difficulty Level: L3

In [451]:
df = pd.DataFrame(np.random.randint(1,100, 40).reshape(10, -1), columns=list('pqrs'), index=list('abcdefghij'))
df

    p   q   r   s
a  22  24  62  58
b  76  22  24  16
c  46  33  88  74
d  37  35  78  30
e  22  84  85  96
f  42  84  91  86
g  57  51  84  59
h  90  64  17  47
i  87  52  57  22
j  48  45  34  81

## 46. How to create a column containing the minimum by maximum of each row?
Difficulty Level: L2

Compute the minimum-by-maximum for every row of df.

In [452]:
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))
df

    0   1   2   3   4   5   6   7   8   9
0  26  59  87  95  16  76  50  33  51  82
1  64   5  16  68  81  47  57  75  38  63
2  43  10  72  39  35  93  39  23  23  39
3  40  64  19   5  72  16  56  62  28   3
4  55   4  66  51  25  65  72  27  77  90
5  65  36  42  49  86  25  97  80  62  74
6  67   5  75  82  39  15  64  69  59  56
7  34  43  62  37  37  19  55  71  84  46

In [453]:
df['min/max'] = df.min(axis=1)/df.max(axis=1)
df

    0   1   2   3   4   5   6   7   8   9   min/max
0  26  59  87  95  16  76  50  33  51  82  0.168421
1  64   5  16  68  81  47  57  75  38  63  0.061728
2  43  10  72  39  35  93  39  23  23  39  0.107527
3  40  64  19   5  72  16  56  62  28   3  0.041667
4  55   4  66  51  25  65  72  27  77  90  0.044444
5  65  36  42  49  86  25  97  80  62  74  0.257732
6  67   5  75  82  39  15  64  69  59  56  0.060976
7  34  43  62  37  37  19  55  71  84  46  0.226190

## 47. How to create a column that contains the penultimate value in each row?
Difficulty Level: L2

Create a new column 'penultimate' which has the second largest value of each row of df.

In [518]:
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))
df

    0   1   2   3   4   5   6   7   8   9
0  14  44   1  66  24  68  28  94  16  40
1  67  86  22  37  58  94  92  14  55  76
2  94  59  74  53  43  41  59  91  48   8
3  66  88  58  48  58  91  65  19  51  34
4  50  25  90   6  54  78  83  86  69  64
5  38  51  82   1  50  92  13  70  84  82
6  47  73  57  69  34  93  46  64  70   1
7  80  84  83  46  43  28  83  13  88  79

In [519]:
df['sec_max'] ='x'
for idx, row in df.iterrows():
    #print(np.sort(row.values[0:-2])[1])
    df.iloc[idx,-1] = np.sort(row.values[0:-2])[1]
df

    0   1   2   3   4   5   6   7   8   9 sec_max
0  14  44   1  66  24  68  28  94  16  40      14
1  67  86  22  37  58  94  92  14  55  76      22
2  94  59  74  53  43  41  59  91  48   8      43
3  66  88  58  48  58  91  65  19  51  34      48
4  50  25  90   6  54  78  83  86  69  64      25
5  38  51  82   1  50  92  13  70  84  82      13
6  47  73  57  69  34  93  46  64  70   1      46
7  80  84  83  46  43  28  83  13  88  79      28

## 48. How to normalize all columns in a dataframe?
Difficulty Level: L2

Normalize all columns of df by subtracting the column mean and divide by standard deviation.
Range all columns of df such that the minimum value in each column is 0 and max is 1.
Don’t use external packages like sklearn.

In [521]:
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))
df

    0   1   2   3   4   5   6   7   8   9
0  51  23  43  29  10  17  85   1  76   7
1  23  11  21  97  17  52  89  74  79  42
2   8  62  24  62  33  41   3  70  93  87
3   2   7  61  88  16  34  36  17  45  35
4  15  18  66  21   4  57  89  45  18  62
5  37  85  19  74  52  17  78  22   1  53
6  48  76  46  25  74  33  27  34  84  67
7  82  42  16  74  73   3  34  45  58  70

In [523]:
vals_means =df.mean(axis=0)
vals_dev =df.std(axis=0)

In [526]:
df_1=df.subtract(vals_means,axis=1)
df_1

       0     1     2      3       4      5       6     7      8       9
0  17.75 -17.5   6.0 -29.75 -24.875 -14.75  29.875 -37.5  19.25 -45.875
1 -10.25 -29.5 -16.0  38.25 -17.875  20.25  33.875  35.5  22.25 -10.875
2 -25.25  21.5 -13.0   3.25  -1.875   9.25 -52.125  31.5  36.25  34.125
3 -31.25 -33.5  24.0  29.25 -18.875   2.25 -19.125 -21.5 -11.75 -17.875
4 -18.25 -22.5  29.0 -37.75 -30.875  25.25  33.875   6.5 -38.75   9.125
5   3.75  44.5 -18.0  15.25  17.125 -14.75  22.875 -16.5 -55.75   0.125
6  14.75  35.5   9.0 -33.75  39.125   1.25 -28.125  -4.5  27.25  14.125
7  48.75   1.5 -21.0  15.25  38.125 -28.75 -21.125   6.5   1.25  17.125

In [527]:
df_2 = df_1.divide(vals_dev,axis=1)
df_2

,0,1,2,3,4,5,6,7,8,9
0,0.665777,-0.573848,0.304156,-0.996144,-0.885103,-0.796342,0.882014,-1.479349,0.581486,-1.854631
1,-0.384463,-0.967343,-0.811083,1.280756,-0.636029,1.093283,1.000108,1.400450,0.672108,-0.439654
2,-0.947092,0.705013,-0.659005,0.108822,-0.066716,0.499401,-1.538912,1.242653,1.095007,1.379603
3,-1.172143,-1.098508,1.216625,0.979402,-0.671611,0.121476,-0.564637,-0.848160,-0.354933,-0.722649
4,-0.684532,-0.737804,1.470088,-1.264014,-1.098595,1.363230,1.000108,0.256420,-1.170525,0.368905
5,0.140657,1.459212,-0.912469,0.510628,0.609342,-0.796342,0.675350,-0.650913,-1.684045,0.005053
6,0.553252,1.164091,0.456234,-1.130079,1.392147,0.067487,-0.830348,-0.177522,0.823143,0.571044
7,1.828543,0.049187,-1.064547,0.510628,1.356565,-1.552192,-0.623684,0.256420,0.037759,0.692328

## 49. How to compute the correlation of each row with the suceeding row?
Difficulty Level: L2

Compute the correlation of each row of df with its succeeding row.

In [528]:
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))
df

    0   1   2   3   4   5   6   7   8   9
0  96  34  61  32  90  47  38   2  17  77
1  39  80  80  12   6  76  88  47  39  97
2  17  75  15  43  11  90  81  22  55  67
3  86  87  38  89  67  43  48  93  94  12
4   7  21  56  81  83  81  72  93  17   7
5  61  53  27  13  64  92  66  46  99  49
6  68  29  50  38  63  24  46  29  54  80
7  64  86  65  99  60  68  32  46  28  74

In [529]:
df.corr()

,0,1,2,3,4,5,6,7,8,9
0,1.000000,0.089577,0.135637,-0.010375,0.459713,-0.675597,-0.766338,-0.272419,0.245537,0.167913
1,0.089577,1.000000,-0.057321,0.208791,-0.592882,0.214532,0.076392,0.128239,0.352815,0.154083
2,0.135637,-0.057321,1.000000,0.042727,0.076378,-0.261569,-0.158119,0.023842,-0.639581,0.360000
3,-0.010375,0.208791,0.042727,1.000000,0.363705,-0.168366,-0.469175,0.573042,-0.165889,-0.561835
4,0.459713,-0.592882,0.076378,0.363705,1.000000,-0.406222,-0.686031,0.174094,-0.126079,-0.487697
5,-0.675597,0.214532,-0.261569,-0.168366,-0.406222,1.000000,0.656125,0.111713,0.035370,-0.104557
6,-0.766338,0.076392,-0.158119,-0.469175,-0.686031,0.656125,1.000000,0.159332,0.098424,-0.001712
7,-0.272419,0.128239,0.023842,0.573042,0.174094,0.111713,0.159332,1.000000,0.245871,-0.808510
8,0.245537,0.352815,-0.639581,-0.165889,-0.126079,0.035370,0.098424,0.245871,1.000000,-0.280638
9,0.167913,0.154083,0.360000,-0.561835,-0.487697,-0.104557,-0.001712,-0.808510,-0.280638,1.000000

## 50. How to replace both the diagonals of dataframe with 0?
Difficulty Level: L2

Replace both values in both diagonals of df with 0.

In [530]:
df = pd.DataFrame(np.random.randint(1,100, 100).reshape(10, -1))
df

    0   1   2   3   4   5   6   7   8   9
0  10  16  46  20  95  87  55  28  12  89
1  25  46  97   9  25  60  62  47  45  21
2  60  86  36  78  29  24  96  94  42  41
3  15   5   4  72  81  69   2  55  25  11
4   9  52  99  31  14  71  13  22  87  45
5   2  22  33  91  63  41  30  40  65  46
6  79  69  55  54   3  26  61  99  14  82
7  60  24  62  44  67  43  76  57  34  71
8  20  67  96  34  62   4  47  77  33   6
9  59   6  83  56  11  78  67  73  90  75

In [551]:
arr = np.array(df)
arr[np.diag_indices(10)]=0
arr

array([[ 0, 16, 46, 20, 95, 87, 55, 28, 12, 89],
       [25,  0, 97,  9, 25, 60, 62, 47, 45, 21],
       [60, 86,  0, 78, 29, 24, 96, 94, 42, 41],
       [15,  5,  4,  0, 81, 69,  2, 55, 25, 11],
       [ 9, 52, 99, 31,  0, 71, 13, 22, 87, 45],
       [ 2, 22, 33, 91, 63,  0, 30, 40, 65, 46],
       [79, 69, 55, 54,  3, 26,  0, 99, 14, 82],
       [60, 24, 62, 44, 67, 43, 76,  0, 34, 71],
       [20, 67, 96, 34, 62,  4, 47, 77,  0,  6],
       [59,  6, 83, 56, 11, 78, 67, 73, 90,  0]])

In [556]:
np.flip(arr,axis=1)[np.diag_indices(10)]=0
arr

array([[ 0, 16, 46, 20, 95, 87, 55, 28, 12,  0],
       [25,  0, 97,  9, 25, 60, 62, 47,  0, 21],
       [60, 86,  0, 78, 29, 24, 96,  0, 42, 41],
       [15,  5,  4,  0, 81, 69,  0, 55, 25, 11],
       [ 9, 52, 99, 31,  0,  0, 13, 22, 87, 45],
       [ 2, 22, 33, 91,  0,  0, 30, 40, 65, 46],
       [79, 69, 55,  0,  3, 26,  0, 99, 14, 82],
       [60, 24,  0, 44, 67, 43, 76,  0, 34, 71],
       [20,  0, 96, 34, 62,  4, 47, 77,  0,  6],
       [ 0,  6, 83, 56, 11, 78, 67, 73, 90,  0]])

## 51. How to get the particular group of a groupby dataframe by key?
Difficulty Level: L2

This is a question related to understanding of grouped dataframe. From df_grouped, get the group belonging to 'apple' as a dataframe.

In [559]:
df = pd.DataFrame({'col1': ['apple', 'banana', 'orange'] * 3,
                   'col2': np.random.rand(9),
                   'col3': np.random.randint(0, 15, 9)})
df

     col1      col2  col3
0   apple  0.749053    12
1  banana  0.783033     7
2  orange  0.840598     0
3   apple  0.450923     4
4  banana  0.623228    13
5  orange  0.382970     2
6   apple  0.647669     1
7  banana  0.544275    12
8  orange  0.988824     7

In [566]:
df.iloc[df.groupby('col1').groups['apple'].values,:]

    col1      col2  col3
0  apple  0.749053    12
3  apple  0.450923     4
6  apple  0.647669     1

## 52. How to get the n’th largest value of a column when grouped by another column?
Difficulty Level: L2

In df, find the second largest value of 'taste' for 'banana'

In [567]:
df = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                   'taste': np.random.rand(9),
                   'price': np.random.randint(0, 15, 9)})
df

    fruit     taste  price
0   apple  0.615357      3
1  banana  0.546862      1
2  orange  0.439075      1
3   apple  0.742363     11
4  banana  0.786539      4
5  orange  0.690605      7
6   apple  0.795131      9
7  banana  0.920929     11
8  orange  0.328976      3

In [572]:
df_banana = df.iloc[df.groupby('fruit').groups['banana'].values,:]
df_banana

    fruit     taste  price
1  banana  0.546862      1
4  banana  0.786539      4
7  banana  0.920929     11

In [574]:
df_banana['taste'].sort_values()[1]

0.5468624791849618

## 53. How to compute grouped mean on pandas dataframe and keep the grouped column as another column (not index)?
Difficulty Level: L1

In df, Compute the mean price of every fruit, while keeping the fruit as another column instead of an index.

In [1158]:
df = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                   'rating': np.random.rand(9),
                   'price': np.random.randint(0, 15, 9)})
df

    fruit    rating  price
0   apple  0.754992      2
1  banana  0.693931     13
2  orange  0.594358      8
3   apple  0.914538     14
4  banana  0.745988      5
5  orange  0.757525      5
6   apple  0.128086     11
7  banana  0.289520     14
8  orange  0.817181     13

In [575]:
df.groupby('fruit')['price'].mean()

fruit
apple     7.666667
banana    5.333333
orange    3.666667
Name: price, dtype: float64

## 54. How to join two dataframes by 2 columns so they have only the common rows?
Difficulty Level: L2

Join dataframes df1 and df2 by ‘fruit-pazham’ and ‘weight-kilo’.

In [576]:
df1 = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                    'weight': ['high', 'medium', 'low'] * 3,
                    'price': np.random.randint(0, 15, 9)})
df1

    fruit  weight  price
0   apple    high     12
1  banana  medium     13
2  orange     low      6
3   apple    high      2
4  banana  medium     13
5  orange     low     12
6   apple    high     10
7  banana  medium      1
8  orange     low      6

In [582]:
df2 = pd.DataFrame({'pazham': ['apple', 'orange', 'pine'] * 2,
                    'kilo': ['high', 'low'] * 3,
                    'price': np.random.randint(0, 15, 6)})
df2

   pazham  kilo  price
0   apple  high      8
1  orange   low     13
2    pine  high     13
3   apple   low     13
4  orange  high      8
5    pine   low      4

In [585]:
pd.merge(df1,df2, how='inner', left_on=['fruit','weight'],right_on=['pazham','kilo'])

    fruit weight  price_x  pazham  kilo  price_y
0   apple   high       10   apple  high        8
1   apple   high       13   apple  high        8
2   apple   high        7   apple  high        8
3  orange    low       14  orange   low       13
4  orange    low        0  orange   low       13
5  orange    low        5  orange   low       13

## 55. How to get the positions where values of two columns match?
Difficulty Level: L2

In [593]:
df1 = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                    'kilo': ['high', 'medium', 'low'] * 3,})
df1

    fruit    kilo
0   apple    high
1  banana  medium
2  orange     low
3   apple    high
4  banana  medium
5  orange     low
6   apple    high
7  banana  medium
8  orange     low

In [594]:
df2 = pd.DataFrame({'fruit': ['apple', 'orange', 'pine'] * 2,
                    'kilo': ['high', 'low'] * 3,})
df2

    fruit  kilo
0   apple  high
1  orange   low
2    pine  high
3   apple   low
4  orange  high
5    pine   low

In [604]:
df1[df1.isin(df2).all(1)].index.values

array([0])

## 56. How to create lags and leads of a column in a dataframe?
Difficulty Level: L2

Create two new columns in df, one of which is a lag1 (shift column a down by 1 row) of column ‘a’ and the other is a lead1 (shift column b up by 1 row).

In [609]:
df = pd.DataFrame(np.random.randint(1, 100, 20).reshape(-1, 4), columns = list('abcd'))
df

    a   b   c   d
0  80  88  25  66
1  60  43  85  16
2  24  31  89  49
3   3  98  48  77
4  99  48  81  67

In [611]:
df['a']=df['a'].shift(1,axis=0).convert_dtypes('int')
df

      a   b   c   d
0  <NA>  88  25  66
1    80  43  85  16
2    60  31  89  49
3    24  98  48  77
4     3  48  81  67

In [612]:
df['b']=df['b'].shift(-1,axis=0).convert_dtypes('int')
df

      a     b   c   d
0  <NA>    43  25  66
1    80    31  85  16
2    60    98  89  49
3    24    48  48  77
4     3  <NA>  81  67

## 57. How to get the frequency of unique values in the entire dataframe?
Difficulty Level: L2

Get the frequency of unique values in the entire dataframe df.

In [613]:
df = pd.DataFrame(np.random.randint(1, 10, 20).reshape(-1, 4), columns = list('abcd'))
df

   a  b  c  d
0  6  3  8  5
1  7  4  2  3
2  9  9  6  6
3  4  4  3  9
4  2  4  3  1

In [617]:
df.melt()['value'].value_counts()

3    4
4    4
6    3
9    3
2    2
1    1
5    1
7    1
8    1
Name: value, dtype: int64

## 58. How to split a text column into two separate columns?
Difficulty Level: L2

Split the string column in df to form a dataframe with 3 columns as shown.

In [618]:
df = pd.DataFrame(["STD, City    State",
"33, Kolkata    West Bengal",
"44, Chennai    Tamil Nadu",
"40, Hyderabad    Telengana",
"80, Bangalore    Karnataka"], columns=['row'])
df

                          row
0          STD, City    State
1  33, Kolkata    West Bengal
2   44, Chennai    Tamil Nadu
3  40, Hyderabad    Telengana
4  80, Bangalore    Karnataka

In [619]:
import re

In [642]:
std_lines = df['row'].apply(lambda x: re.sub('([0-9]+), ([A-Za-z]+) +([A-Za-z]+.*)','\g<1>-\g<2>-\g<3>',x))
std_lines

0        STD, City    State
1    33-Kolkata-West Bengal
2     44-Chennai-Tamil Nadu
3    40-Hyderabad-Telengana
4    80-Bangalore-Karnataka
Name: row, dtype: object

In [662]:
df.replace(r'([0-9]+), ([A-Za-z]+) +([A-Za-z]+.*)',r'\1-\2-\3',regex=True)

                      row
0      STD, City    State
1  33-Kolkata-West Bengal
2   44-Chennai-Tamil Nadu
3  40-Hyderabad-Telengana
4  80-Bangalore-Karnataka

In [655]:
l =[]
for x in std_lines[1:].values:
    x = x.split('-')
    l.append({'STD': x[0], 'City': x[1], 'State':x[2]})
pd.DataFrame(l)

  STD       City        State
0  33    Kolkata  West Bengal
1  44    Chennai   Tamil Nadu
2  40  Hyderabad    Telengana
3  80  Bangalore    Karnataka

In [659]:
std_lines[1:].str.split('-',expand=True)

    0          1            2
1  33    Kolkata  West Bengal
2  44    Chennai   Tamil Nadu
3  40  Hyderabad    Telengana
4  80  Bangalore    Karnataka